[
  {
    "path": "posts/welcome/",
    "title": "Welcome to ISSS608 PROJECT",
    "description": "Welcome to our new blog, ISSS608 PROJECT. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-26T22:20:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-26-project-proposal/",
    "title": "Who I am & Who You Are",
    "description": "Project Proposal",
    "author": [
      {
        "name": "Joanna & Yen Ngee",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-26",
    "categories": [],
    "contents": "\r\nIntroduction\r\nThe goal of the annual Institute of Electrical and Electronics Engineers (IEEE) Visual Analytics Science and Technology (VAST) Challenge is to advance the field of visual analytics through competition. The 2021 IEEE VAST Challenge brings back a classic challenge from 2014 to see how approaches and techniques have developed since the original release of the challenge.\r\nThe background of the challenge is as below:\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\nObjective\r\nThis project aims to understand better the individuals and organizations that are involved in this situation. We do this by exploring and doing the following:\r\nObtaining a more holistic profile of employees\r\nUnderstanding what the daily routines and characteristics of the employees are like.\r\nExploring if there is a difference between their weekday and weekend routines? Are their daily routines dependent on their employment type?\r\nIdentifying defining characteristics of individuals/organization, like how many coffees this person drink a day, how many times does this person appear in news articles, what are each person’s expenditure etc\r\nIdentifying any anomalous or suspicious behavior.\r\n\r\nIdentifying formal (work-related) or informal (non-work related e.g., playing golf together during the weekends) relationships.\r\nDiscover different ways of grouping/segmenting the employees.\r\nDiscover any associations based on common interest given in the data.\r\nAre there any relationships between CC expenditure + GPS [MC2] and events we can extract from News articles [MC1]\r\n\r\nWe will do so by delivering an R-Shiny app that provides:\r\nInteractive user interface design\r\nExploratory functionality that allows user to interact with the data and gain insights.\r\nVisualize individual/organization profiles and relationships between them.\r\nDatasets\r\nWe’ll be using data sets from Mini-Challenge 1 [MC1] and Mini-Challenge 2 [MC2].\r\nFrom [MC1], we will be transforming the non-structured data in form of news articles into structured data via text analytics and then extract attributes per individual.\r\nFrom [MC2], we will be extracting insights based on credit card transactions and geographical data.\r\nWe will also be joining the two data sets based on individuals to analyzing attributes by features across data sets.\r\nScope and Methodology\r\nOur scope and methodology is as below:\r\nData preparation using dplyr and other r packages\r\nAnalysis of VAST 21 data set with background research using some of the following methods:\r\nExploratory Data Analysis (EDA) methods in R\r\nExploratory Spatial Data Analysis (ESDA) methods in R\r\nClustering methods for aspatial and geospatial information in R\r\nText analysis in R\r\nNetwork Analysis in R\r\n\r\nCreating a R shiny dashboard showing our findings/insights and conclusions:\r\nR Markdown development for functionality checks\r\nR-Shiny app development for user interactivity\r\n\r\nFirst look\r\nMap of Abila, Kronos \r\nTrend of credit card transactions over time - The number of credit card transactions peak at 1pm and 8pm on a daily basis.\r\n\r\nMovement of Cars & Trucks - We see that there is no movement of trucks over the weekends. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-26T22:41:25+08:00",
    "input_file": "project-proposal.knit.md"
  }
]
